package pareto.writer.api;

import org.springframework.web.bind.annotation.*;
import pareto.writer.api.dto.RawRecordDto;
import pareto.writer.api.dto.RecordDto;
import pareto.writer.api.dto.RecordRowDto;

import java.util.List;

@RestController
public class RecordController {

    @GetMapping("/record")
    public List<RecordDto> getAllRecords() {
        return List.of(
                new RecordDto(2, "24 марта 2019", List.of(
                        new RecordRowDto("metrics", "Метрика 1 - значение 1. Метрика 2 - значение 2. Метрика 3 - значение 3."),
                        new RecordRowDto("header", "Название блока 1"),
                        new RecordRowDto("paragraph", "Абзац 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                        new RecordRowDto("paragraph", "Абзац 2. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                        new RecordRowDto("header", "Название блока 2"),
                        new RecordRowDto("paragraph", "Абзац 1. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. "),
                        new RecordRowDto("paragraph", "Абзац 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. ")
                )),
                new RecordDto(1, "23 марта 2019", List.of(
                        new RecordRowDto("metrics", "Метрика 1 - значение 1. Метрика 2 - значение 2. Метрика 3 - значение 3."),
                        new RecordRowDto("header", "Название блока 1"),
                        new RecordRowDto("paragraph", "Абзац 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                        new RecordRowDto("paragraph", "Абзац 2. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                        new RecordRowDto("header", "Название блока 2"),
                        new RecordRowDto("paragraph", "Абзац 1. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. "),
                        new RecordRowDto("paragraph", "Абзац 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. ")
                ))
        );
    }
    
    @GetMapping("/rawrecord/{id}")
    public RawRecordDto getRawRecord(@PathVariable long id) {
        return new RawRecordDto(
                "Метрика 1 - значение 1. Метрика 2 - значение 2. Метрика 3 - значение 3.\n" +
                        "Название блока 1\n" +
                        "Абзац 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. \n" +
                        "Абзац 2. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. \n" +
                        "Название блока 2\n" +
                        "Абзац 1. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. \n" +
                        "Абзац 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. \n"
        );
    }

    @PutMapping("/rawrecord/{id}")
    public RecordDto editRawRecord(@PathVariable long id, @RequestBody RawRecordDto dto) {
        return new RecordDto(id, "23 марта 2019", List.of(
                new RecordRowDto("metrics", "Метрика 1 - значение 2. Метрика 2 - значение 2. Метрика 3 - значение 3."),
                new RecordRowDto("header", "Название блока 1"),
                new RecordRowDto("paragraph", "Абзац 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                new RecordRowDto("paragraph", "Абзац 2. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                new RecordRowDto("header", "Название блока 2"),
                new RecordRowDto("paragraph", "Абзац 1. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. "),
                new RecordRowDto("paragraph", "Абзац 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. ")
        ));
    }

    @PostMapping("/rawrecord")
    public RecordDto editRawRecord(@RequestBody RawRecordDto dto) {
        return new RecordDto(4, "23 марта 2019", List.of(
                new RecordRowDto("metrics", "Метрика 1 - значение 2222. Метрика 2 - значение 2. Метрика 3 - значение 3."),
                new RecordRowDto("header", "Название блока 1"),
                new RecordRowDto("paragraph", "Абзац 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                new RecordRowDto("paragraph", "Абзац 2. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. Блок 1. "),
                new RecordRowDto("header", "Название блока 2"),
                new RecordRowDto("paragraph", "Абзац 1. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. "),
                new RecordRowDto("paragraph", "Абзац 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. Блок 2. ")
        ));
    }
}